 00000* VALIDATION OF BASE COBOL INSTALL
	IDENTIFICATION DIVISION.
 01100 PROGRAM-ID. 'HELLO WORLD'.
 02000 ENVIRONMENT DIV
      -ISION.
 02100 CONFIGURATION SECTION.
 02110 SOURCE-COMPUTER.  GNULINUX.
 02120 OBJECT-COMPUTER.  HERCULES.
 02200 SPECIAL
      --NAMES.
 02210     CONSOLE IS CONSL.
 03000 DATA DIVISION.
 04000          PROCEDUR
      -   E DIVISION.
 04100 00-MAIN.
 04110     DISPLAY
           'HELLO, WORLD'
           UPON CONSL.
 04900     STOP RUN.
