       IDENTIFICATION DIVISION.
       PROGRAM-ID. 'Test program name'.
       PROCEDURE DIVISION.
       MAIN.
           DISPLAY 'This is a test program'.
       STOP RUN.
       END PROGRAM 'Test program name'.
